In [1]:
import pandas as pd

In [2]:
filepath='DataFiles/data.xlsx'
df=pd.read_excel(filepath)

In [3]:
df.head()

      name  age   department  salary
0    Alice   30           HR   50000
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [9]:
df.sort_values(by="name",ascending=False)

       name  age   department  salary
9      Jack   28  Engineering   62000
8       Ian   34           HR   51000
7    Hannah   23        Sales   53000
6     Grace   31  Engineering   70000
5     Frank   27        Sales   58000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
3     David   35  Engineering   80000
2   Charlie   26        Sales   55000
1       Bob   24  Engineering   60000
0     Alice   30           HR   50000

In [10]:
df[df['salary']<60000]

       name  age department  salary
0     Alice   30         HR   50000
2   Charlie   26      Sales   55000
4       Eve   29         HR   52000
5     Frank   27      Sales   58000
7    Hannah   23      Sales   53000
8       Ian   34         HR   51000
10      Eve   29         HR   52000

In [11]:
df.iloc[2:5]

      name  age   department  salary
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [12]:
df.shape

(11, 4)

In [13]:
df.columns

Index(['name', 'age', 'department', 'salary'], dtype='object')

### Grouping and Aggrigation
We want to group our data by the department

In [17]:
grouped=df.groupby("department")

In [18]:
grouped

In [20]:
grouped=df.groupby('department')['salary'].mean()

In [21]:
grouped

department
Engineering    68000.000000
HR             51250.000000
Sales          55333.333333
Name: salary, dtype: float64

In [24]:
df.groupby('department').agg({
    'salary':['sum','mean','count','min','max','std','var','median'],
})

             salary                                                 \
                sum          mean count    min    max          std
department
Engineering  272000  68000.000000     4  60000  80000  9092.121131
HR           205000  51250.000000     4  50000  52000   957.427108
Sales        166000  55333.333333     3  53000  58000  2516.611478


                      var   median
department
Engineering  8.266667e+07  66000.0
HR           9.166667e+05  51500.0
Sales        6.333333e+06  55000.0

In [25]:
    
df.groupby('department').agg({
    'age':['sum','mean','count','min','max','std','var','median'],
})

             age
             sum       mean count min max       std        var median
department
Engineering  118  29.500000     4  24  35  4.654747  21.666667   29.5
HR           122  30.500000     4  29  34  2.380476   5.666667   29.5
Sales         76  25.333333     3  23  27  2.081666   4.333333   26.0